\documentclass{article}

\begin{document}
\begin{center}
{\bf twistedLogCohomology(List,List) -- twisted logarithmic cohomology groups in two variables}
\end{center}
\begin{flushleft}

{\bf Synopsis}

\begin{itemize}
\item Usage: twistedLogCohomology(F,A)
\item Function: twistedLogCohomology
\item inputs:
  \begin{itemize}
	\item F, a list of polynomials in two variables
	\item A, a list of rational numbers
  \end{itemize}
\item outputs:
  \begin{itemize}
	\item a hashtable, with entries $\{$ Bfunction, CohomologyGroups, LogBasis, OmegaRes, PreCycles, VResolution   $\}$
  \end{itemize}
\end{itemize}

{\bf Description}

Bases of twisted logarithmic cohomology groups are contained in a hashtable LogBasis. 
Bases of $H^1$ and $H^2$ are outputted only numerators. 
In following example, a basis of $H^1$ is 
$\{ \frac{y^2dx-xydy}{x(x+y)}, \frac{2x^2dx+2xydx}{x(x+y)} \}$, 
a basis of $H^2$ is $\{ \frac{ydxdy}{x(x+y)} \}$. 

{\footnotesize 
\begin{verbatim}
i1 : loadPackage "Dmodules";

i2 : load "twistedLogCohomology.m2";

i3 : R = QQ[x,y];

i4 : twistedLogCohomology({x,x+y},{-1,0})
Warning: not a generic weight vector.  Could be difficult...

o5 = HashTable{BFunction => (s - 1)                                                                    }
                                                    1
               CohomologyGroups => HashTable{0 => QQ }
                                                    2
                                             1 => QQ
                                                    1
                                             2 => QQ
               LogBasis => HashTable{0 => | x |                    }
                                     1 => | y2dx-xydy 2x2dx+2xydx |
                                     2 => | ydxdy |
                                             1                       2                       1
               OmegaRes => (QQ[x, y, dx, dy])  <-- (QQ[x, y, dx, dy])  <-- (QQ[x, y, dx, dy])  <-- 0
                                                                                                    
                           0                       1                       2                       3
               PreCycles => HashTable{0 => | -x2-xy |}
                                           | -x     |
                                      1 => | 0  -2x |
                                           | -y 0   |
                                           | 0  0   |
                                      2 => | y |
                                                1                       3                       2
               VResolution => (QQ[x, y, dx, dy])  <-- (QQ[x, y, dx, dy])  <-- (QQ[x, y, dx, dy])  <-- 0
                                                                                                       
                              0                       1                       2                       3

o5 : HashTable

\end{verbatim}
}

\end{flushleft}
\end{document}